let data = [{
    'type': '感冒',
    'subType': [{
        'subName': '风寒感冒',
        'des': '恶寒较重，发热轻，无汗头痛，流清涕，痰稀白。脉浮紧',
        'method1': '荆防败毒散',
        'method2': '荆防颗粒、九味羌活丸、感冒清热颗粒、葛根汤等'
    }, {
        'subName': '风热感冒',
        'des': '身热较著，微恶风，头胀痛，咽痛口渴。舌尖红，脉浮数',
        'method1': '银翘散',
        'method2': '银翘解毒丸、双黄连口服液、桑菊感冒片等'
    }, {
        'subName': '气虚感冒',
        'des': '恶寒较甚，无汗头痛，身楚倦怠，咳痰无力。脉浮而无力',
        'method1': '参苏饮',
        'method2': '败毒散（也称为“人参败毒散”）'
    }, {
        'subName': '时行感冒',
        'des': '突然发热，高热不退，甚则寒战，周身酸痛，流行性发作',
        'method1': '清瘟败毒饮',
        'method2': '清瘟解毒片、连花清瘟胶囊等'
    }]
}, {
    'type': '咳嗽',
    'subType': [{
        'subName': '风寒袭肺',
        'des': '咳嗽声重，气急，咳痰稀薄色白（伴“风寒感冒”症状）',
        'method1': '三拗汤合止嗽散',
        'method2': '三拗片、通宣理肺丸、杏苏止咳糖浆等'
    }, {
        'subName': '风热犯肺',
        'des': '咳嗽气粗，咳痰不爽，咳痰黄稠（伴“风热感冒”症状）',
        'method1': '桑菊饮（菊花辛凉解表）',
        'method2': '桑菊感冒片、急支糖浆、羚羊清肺颗粒等'
    }, {
        'subName': '风燥伤肺',
        'des': '干咳无痰，痰中带血（伴燥邪共性：鼻燥咽干，舌红少津，脉浮数）',
        'method1': '桑杏汤（杏仁润肺）',
        'method2': '二母宁嗽丸、蜜炼川贝枇杷膏等'
    }, {
        'subName': '肺阴亏耗',
        'des': '干咳少痰，痰中带血（伴阴虚共性：五心烦热，颧红少苔，脉细数）',
        'method1': '沙参麦冬汤',
        'method2': '养阴清肺膏、百合固金丸、二冬膏'
    }, {
        'subName': '痰湿蕴肺',
        'des': '咳声重浊，痰多黏腻或易咳，食后咳甚痰多，稍进甘甜油腻物加重',
        'method1': '二陈平胃散合三子养亲汤',
        'method2': '二陈丸、橘贝半夏颗粒、蛇胆陈皮胶 囊'
    }, {
        'subName': '痰热郁肺',
        'des': '咳嗽气粗，痰多黏稠而色黄，胸胁胀满面赤，舌红苔黄腻，脉滑数',
        'method1': '清金化痰汤',
        'method2': '清肺化痰丸、清肺抑火丸、复方鲜竹沥液'
    }]
}, {
    'type': '喘证',
    'subType': [{
        'subName': '风寒闭肺',
        'des': '喘咳，呼吸急促，痰多色白稀薄而带泡沫（伴“风寒感冒”症状）',
        'method1': '麻黄汤合华盖散',
        'method2': '小青龙合剂、桂龙咳喘宁胶囊等'
    }, {
        'subName': '痰热壅肺',
        'des': '喘咳，痰黏稠而色黄。伴胸中烦闷，身热，有汗。苔黄腻，脉滑数',
        'method1': '桑白皮汤',
        'method2': '清肺消炎丸、葶贝胶囊'
    }, {
        'subName': '痰浊阻肺',
        'des': '喘咳，痰多黏腻色白。伴呕恶食少，口黏，不渴。苔白腻，脉滑',
        'method1': '二陈汤合三子养亲汤',
        'method2': '橘红痰咳颗粒、祛痰止咳颗粒'
    }, {
        'subName': '肾不纳气',
        'des': '喘促日久，动则喘甚，呼多吸少，气不得续（肾不纳气典型症状）',
        'method1': '肾气丸合参蛤散',
        'method2': '补金片'
    }]
}, {
    'type': '肺胀',
    'subType': [{
        'subName': '肺肾气虚',
        'des': '胸部膨满，呼吸浅短难续，甚则张口抬肩不能平卧，腰膝酸软',
        'method1': '平喘固本汤合补肺汤',
        'method2': '参茸黑锡丸、百令胶囊'
    }, {
        'subName': '痰浊阻肺',
        'des': '胸膺满闷，短气喘息，稍劳即著，咳嗽痰多，色白黏腻或呈泡沫',
        'method1': '苏子降气汤合三子养亲汤',
        'method2': '苏子降气丸、理气定喘丸'
    }, {
        'subName': '痰热郁肺',
        'des': '胸满咳逆，喘息气粗，痰黄黏稠，烦躁口渴。舌红苔黄腻，脉滑数',
        'method1': '越婢加半夏汤，桑白皮汤',
        'method2': '押题张秒杀：痰热把奴婢的肺憋炸了'
    }]
}, {
    'type': '心悸',
    'subType': [{
        'subName': '心脾两虚',
        'des': '心悸气短，头晕目眩，失眠健忘，面色无华，倦怠乏力，纳呆食少',
        'method1': '归脾汤',
        'method2': '人参归脾丸、复方扶芳藤合剂、益气养血口服液、消疲灵'
    }, {
        'subName': '阴虚火旺',
        'des': '心悸易惊，心烦失眠，五心烦热，口干少津，耳鸣盗汗，急躁易怒',
        'method1': '天王补心丹',
        'method2': '天王补心丸、朱砂安神片、宁神补心片、安神补心丸'
    }, {
        'subName': '心阳不振',
        'des': '心悸不安，胸闷气短，动则尤甚，面色苍白，形寒肢冷，脉虚无力',
        'method1': '参附汤合桂枝甘草龙骨牡蛎汤',
        'method2': '参仙升脉、心宝丸、芪苈强心胶囊'
    }, {
        'subName': '瘀阻心脉',
        'des': '心悸不安，胸闷不舒，痛如针刺，唇甲青紫，舌质紫暗或有瘀斑',
        'method1': '桃仁红花煎合桂枝甘草龙骨牡蛎汤',
        'method2': '血府逐瘀口服液、稳心颗粒、参松养心胶囊、七叶神安片'
    }]
}, {
    'type': '胸痹',
    'subType': [{
        'subName': '气滞血瘀',
        'des': '心胸如刺如绞，痛有定处（瘀血），入夜为甚，伴有胸闷（气滞）',
        'method1': '血府逐瘀汤',
        'method2': '速效救心丸、复方丹参滴丸、冠心丹参滴丸等'
    }, {
        'subName': '痰浊痹阻',
        'des': '胸闷重而心痛微，痰多气短，肢体沉重，形体肥胖，脉滑',
        'method1': '瓜蒌薤白半夏汤合涤痰汤',
        'method2': '丹蒌片、舒心降脂片、降脂通络胶囊'
    }, {
        'subName': '寒凝心脉',
        'des': '猝然心痛如绞，心痛彻背，喘不得卧，多因气候骤冷而发病或加重',
        'method1': '枳实薤白桂枝汤合当归四逆汤',
        'method2': '冠心苏合、苏合香丸、神香苏合'
    }, {
        'subName': '气虚血瘀',
        'des': '胸痛隐隐，遇劳则发，心悸气短，倦怠懒言，自汗，脉弱而涩或结代',
        'method1': '补阳还五汤',
        'method2': '芪参益气丸、参桂胶囊、活心丸、心力丸'
    }, {
        'subName': '气阴两虚',
        'des': '胸闷隐痛，动则尤甚，心悸气短，倦怠懒言，易汗出，头晕失眠多梦',
        'method1': '生脉散合人参养荣汤',
        'method2': '冠心生脉合剂、益心胶囊、益心舒、益心通'
    }]
}, {
    'type': '不寐',
    'subType': [{
        'subName': '肝火扰心',
        'des': '不寐多梦，急躁易怒，目赤耳鸣，头晕头胀，口干而苦',
        'method1': '龙胆泻肝汤',
        'method2': '泻肝安神丸、复方罗布麻颗粒'
    }, {
        'subName': '痰热扰心',
        'des': '心烦不寐，胸闷脘痞，泛恶嗳气，舌红苔黄腻，脉滑数',
        'method1': '黄连温胆汤（黄连清热燥湿）',
        'method2': '心速宁胶囊、礞石滚痰丸等'
    }, {
        'subName': '心脾两虚',
        'des': '不寐，心悸健忘，多梦易醒，神疲食少，腹胀便溏，面色少华',
        'method1': '归脾汤',
        'method2': '北芪五加片、眠安宁口服液等'
    }, {
        'subName': '心肾不交',
        'des': '心烦不寐，入睡困难，头晕耳鸣，腰膝酸软，潮热盗汗，五心烦热',
        'method1': '六味地黄丸合交泰丸',
        'method2': '乌灵胶囊、滋肾宁神丸'
    }, {
        'subName': '心胆气虚',
        'des': '虚烦不眠，触事易惊，胆怯心悸（伴气短自汗，倦怠乏力）',
        'method1': '安神定志丸合酸枣仁汤',
        'method2': '柏子养心丸'
    }]
}, {
    'type': '胃痛',
    'subType': [{
        'subName': '寒邪客胃',
        'des': '胃痛暴作，喜温恶寒，得温痛减',
        'method1': '良附丸（高良姜温中）',
        'method2': '良附丸、安中片、仲景胃灵丸'
    }, {
        'subName': '饮食伤胃',
        'des': '胃痛胀满，嗳腐恶食。舌苔厚腻',
        'method1': '保和丸（谐音“饱”）',
        'method2': '槟榔四消丸、沉香化滞丸、加味保和丸等'
    }, {
        'subName': '肝气犯胃',
        'des': '胃脘胀痛，痛连两胁，遇烦恼痛作或痛甚，嗳气、矢气则舒',
        'method1': '柴胡疏肝散',
        'method2': '沉香化气丸、舒肝和胃丸、朴沉化郁丸等'
    }, {
        'subName': '湿热中阻',
        'des': '胃脘疼痛，痛势急迫，脘闷灼热，口干口苦，口渴不欲饮，纳呆恶心',
        'method1': '清中汤',
        'method2': '木香槟榔丸、中满分消丸、胃痛宁片'
    }, {
        'subName': '胃阴亏耗',
        'des': '胃隐隐灼痛，饥不欲食，口干咽燥，五心烦热，大便干结',
        'method1': '一贯煎合芍药甘草汤',
        'method2': '胃尔康、胃乐新、阴虚胃痛颗粒等'
    }, {
        'subName': '脾胃虚寒',
        'des': '胃隐隐疼痛，喜温喜按，空腹痛甚，得食痛减，累或受凉加重',
        'method1': '黄芪建中汤',
        'method2': '黄芪健胃膏、温胃舒、虚寒胃痛胶囊等'
    }]
}, {
    'type': '泄泻',
    'subType': [{
        'subName': '寒湿内盛',
        'des': '泄泻清稀，甚则如水样，脘闷食少，腹痛肠鸣',
        'method1': '藿香正气散',
        'method2': '藿香正气水、五苓散'
    }, {
        'subName': '湿热伤中',
        'des': '泻下急迫，或泻而不爽，粪色黄褐、臭秽，肛门灼热',
        'method1': '葛根芩连汤',
        'method2': '香连片、肠康片、痢必灵片、泻痢消等'
    }, {
        'subName': '食滞肠胃',
        'des': '腹痛肠鸣，泻后痛减，泻下粪便臭如败卵。嗳腐吞酸',
        'method1': '保和丸（保谐音饱）',
        'method2': '加味保和丸、枳实导滞丸等'
    }, {
        'subName': '肝气乘脾',
        'des': '腹痛而泻，腹中雷鸣，攻窜作痛，矢气频作，抑郁恼怒或紧张时而泻',
        'method1': '痛泻要方 （攻窜作痛）',
        'method2': '痛泻宁颗粒、养胃颗粒'
    }, {
        'subName': '脾胃虚弱',
        'des': '大便时溏时泻，食后脘闷，稍进油腻，则便次明显增多，面色萎黄',
        'method1': '参苓白术散',
        'method2': '人参健脾丸、补中益气丸等'
    }, {
        'subName': '肾阳虚衰',
        'des': '黎明前泄泻（俗称为“五更泻”），腹部喜温，形寒肢冷，腰膝酸软',
        'method1': '四神丸（治五更泻）',
        'method2': '固本益肠丸（先天之本肾）、桂附理中丸'
    }]
}, {
    'type': '便秘',
    'subType': [{
        'subName': '热秘',
        'des': '大便干结，小便短赤，面红身热，口干、口臭',
        'method1': '麻子仁丸（联想麻辣食物）',
        'method2': '麻仁胶囊、麻仁润肠丸、麻仁滋脾丸等'
    }, {
        'subName': '气秘',
        'des': '大便干结，欲便不得，胸胁痞满，肠鸣矢气，腹中胀痛，嗳气频作',
        'method1': '六磨汤 （做事磨蹭气人）',
        'method2': '四磨汤口服液、厚朴排气合剂'
    }, {
        'subName': '冷秘',
        'des': '大便艰涩，腹痛拘急，胀满拒按，手足不温，呃逆呕吐',
        'method1': '温脾汤合半硫丸',
        'method2': '小建中合剂与四磨汤口服液联用'
    }, {
        'subName': '虚秘',
        'des': '便不干硬，但排便难，汗出短气，便后乏力，神疲肢倦',
        'method1': '黄芪汤',
        'method2': '便秘通胶囊、芪蓉润肠/苁蓉通便口服液'
    }]
}, {
    'type': '头痛',
    'subType': [{
        'subName': '风寒头痛',
        'des': '头痛时作，痛连项背，拘急收紧感，恶风畏寒，受风尤剧，脉浮紧',
        'method1': '川芎茶调散',
        'method2': '川芎茶调颗粒、都梁软胶囊、天麻头痛片'
    }, {
        'subName': '风热头痛',
        'des': '头痛且胀，甚则如裂，发热或恶风，面红目赤。舌红苔黄，脉浮数',
        'method1': '芎芷石膏汤',
        'method2': '芎菊上清丸（只要看到上清必有风热）'
    }, {
        'subName': '肝阳头痛',
        'des': '头昏胀痛，两侧为重，心烦易怒，口苦面红。舌红苔黄，脉弦数',
        'method1': '天麻钩藤饮',
        'method2': '脑立清丸、天麻首乌片、清脑降压片等'
    }, {
        'subName': '瘀血头痛',
        'des': '痛久不愈，痛处固定，痛如锥刺，舌紫暗或有瘀斑瘀点',
        'method1': '通窍活血汤',
        'method2': '通天口服液、血府逐瘀口服液、丹七片等'
    }, {
        'subName': '血虚头痛',
        'des': '头痛隐隐，时时昏晕，面色少华，神疲乏力，遇劳加重',
        'method1': '加味四物汤',
        'method2': '益血生胶囊、养血清脑颗粒、天麻头痛片'
    }]
}, {
    'type': '眩晕',
    'subType': [{
        'subName': '肝阳上亢',
        'des': '眩晕，头目胀痛，耳鸣口苦，急躁易怒，遇烦劳郁怒而加重',
        'method1': '天麻钩藤饮',
        'method2': '松龄血脉康胶囊、复方罗布麻颗粒'
    }, {
        'subName': '气血亏虚',
        'des': '眩晕，动则加剧，劳累即发，唇甲无华，神疲乏力，倦怠懒言',
        'method1': '归脾汤（脾运化气血）',
        'method2': '归脾丸、益中生血片、参茸阿胶'
    }, {
        'subName': '痰湿中阻',
        'des': '眩晕，头重昏蒙，胸闷恶心，呕吐痰涎（湿性沉重，易阻气机）',
        'method1': '半夏白术天麻汤',
        'method2': '半夏天麻丸、眩晕宁颗粒、晕复静片'
    }, {
        'subName': '肾精不足',
        'des': '眩晕，日久不愈，精神萎靡，两目干涩，腰膝酸软',
        'method1': '半夏白术天麻汤',
        'method2': '半夏天麻丸、眩晕宁颗粒、晕复静片'
    }]
}, {
    'type': '胁痛',
    'subType': [{
        'subName': '肝郁气滞',
        'des': '胁肋胀痛，走窜不定，每因情志变化而增减，胸闷腹胀',
        'method1': '柴胡疏肝散',
        'method2': '柴胡舒肝丸、四逆散等'
    }, {
        'subName': '肝胆湿热',
        'des': '胁肋重痛，胸闷恶心，口苦口黏，大便不爽（湿性沉重，易阻气机）',
        'method1': '龙胆泻肝汤',
        'method2': '龙胆泻肝丸、利胆片、胆石清片'
    }, {
        'subName': '瘀血阻络',
        'des': '胁肋刺痛，痛有定处，痛处拒按，入夜痛甚',
        'method1': '血府逐瘀汤',
        'method2': '元胡止痛片、和络舒肝胶囊等'
    }, {
        'subName': '肝络失养',
        'des': '胁肋隐痛，悠悠不休，遇劳加重，口干咽燥',
        'method1': '一贯煎',
        'method2': '复方益肝灵片、慢肝养阴胶囊'
    }]
}, {
    'type': '中风',
    'subType': [{
        'subName': '风痰入络',
        'des': '肌肤不仁，手足麻木，突然口眼㖞斜，语言不利，脉浮数',
        'method1': '真方白丸子（白附子主治）',
        'method2': '大活络丸、再造丸等'
    }, {
        'subName': '风阳上扰',
        'des': '头晕头痛，耳鸣目眩，突然口眼㖞斜，舌强语謇，脉弦',
        'method1': '天麻钩藤饮',
        'method2': '心脑静片、松龄血脉康胶囊等'
    }, {
        'subName': '气虚血瘀',
        'des': '肢体偏枯，肢软无力，面色萎黄无华，舌淡紫或有瘀斑',
        'method1': '补阳还五汤',
        'method2': '消栓胶囊、脉络通、复方地龙胶囊等'
    }]
}, {
    'type': '汗证',
    'subType': [{
        'subName': '阴虚火旺',
        'des': '夜寐盗汗（伴阴虚症状：五心烦热，午后潮热，颧红）',
        'method1': '当归六黄汤',
        'method2': '知柏地黄丸、心脑舒口服液'
    }, {
        'subName': '肺卫不固',
        'des': '汗出恶风稍劳尤甚，易于感冒，体倦乏力，面色少华',
        'method1': '玉屏风散',
        'method2': '复芪止汗颗粒、虚汗停颗粒等'
    }, {
        'subName': '心血不足',
        'des': '睡则汗出醒则自止，心悸怔忡，失眠多梦，面色少华',
        'method1': '归脾汤',
        'method2': '健脾生血颗粒、参茸卫生丸'
    }, {
        'subName': '邪热郁蒸',
        'des': '汗黏易使衣服黄染，面赤烘热，烦躁口苦，小便色黄',
        'method1': '龙胆泻肝汤',
        'method2': '点拨：邪热郁蒸，本质为肝胆湿热'
    }]
}, {
    'type': '消渴',
    'subType': [{
        'subName': '阴虚燥热',
        'des': '烦渴引饮，消谷善饥，小便频数而多，尿浑而黄，形体消瘦',
        'method1': '玉女煎',
        'method2': '消渴平片、消糖灵等'
    }, {
        'subName': '脾胃气虚',
        'des': '口渴引饮，能食与便溏并见，精神不振，四肢乏力',
        'method1': '参苓白术散（白猪脾胃好）',
        'method2': '参苓白术散、益津降糖口服液'
    }, {
        'subName': '气阴两虚',
        'des': '口渴引饮，咽干口燥（阴虚），多食善饥，倦怠乏力（气虚）',
        'method1': '七味白术散合生脉散',
        'method2': '参芪降糖胶囊、参精止渴丸、消渴丸'
    }, {
        'subName': '肾阴亏虚',
        'des': '尿频量多，浊如膏脂，腰膝酸软，头晕耳鸣',
        'method1': '六味地黄丸',
        'method2': '六味地黄丸、麦味地黄丸'
    }, {
        'subName': '阴阳两虚',
        'des': '小便频数，咽干舌燥，腰膝酸软，畏寒肢冷',
        'method1': '肾气丸',
        'method2': '金匮肾气丸'
    }]
}, {
    'type': '淋证',
    'subType': [{
        'subName': '热淋',
        'des': '小便频数短涩，灼热刺痛，舌苔黄腻',
        'method1': '八正散',
        'method2': '八正胶囊、复肾宁片、分清五淋丸'
    }, {
        'subName': '石淋',
        'des': '尿中夹有砂石，排尿涩痛，绞痛难忍',
        'method1': '石韦散',
        'method2': '复方金钱草颗粒、五淋化石丸等'
    }, {
        'subName': '劳淋',
        'des': '小便不甚赤涩，遇劳即发，腰膝酸软',
        'method1': '无比山药丸',
        'method2': '前列回春胶囊等'
    }, {
        'subName': '血淋',
        'des': '小便热涩刺痛，尿色红夹血块',
        'method1': '小蓟饮子（小蓟凉血止血）',
        'method2': '肾炎灵胶囊、五淋丸'
    }, {
        'subName': '气淋',
        'des': '郁怒之后小便涩滞，少腹胀满',
        'method1': '沉香散',
        'method2': '柴胡舒肝丸'
    }, {
        'subName': '膏淋',
        'des': '小便浑浊，乳白或如米泔水样',
        'method1': '程氏萆薢分清饮',
        'method2': '萆薢分清丸、前列泰片（泰山高）'
    }]
}, {
    'type': '癃闭',
    'subType': [{
        'subName': '膀胱湿热',
        'des': '小便点滴不通，短赤灼热，小腹胀满，口黏，苔黄腻',
        'method1': '八正散',
        'method2': '清淋颗粒'
    }, {
        'subName': '湿热瘀阻',
        'des': '小便点滴而下，烦躁口苦。舌紫暗或有瘀点，苔黄腻',
        'method1': '代抵当汤',
        'method2': '癃闭舒胶囊、癃清片、前列通片等'
    }, {
        'subName': '肾阳衰惫',
        'des': '小便点滴不通，排出无力，畏寒肢冷，腰膝酸冷无力',
        'method1': '济生肾气丸',
        'method2': '金匮肾气丸'
    }]
}, {
    'type': '水肿',
    'subType': [{
        'subName': '风水相搏',
        'des': '眼睑浮肿，继则四肢及全身水肿，发病迅速，多有恶寒发热',
        'method1': '越婢加术汤',
        'method2': '肾炎解热片'
    }, {
        'subName': '水湿浸渍',
        'des': '全身水肿，下肢明显，按之没指',
        'method1': '五皮散合胃苓汤',
        'method2': '肾炎消肿片'
    }, {
        'subName': '湿热壅盛',
        'des': '遍体浮肿，皮肤绷急光亮，舌红苔黄腻',
        'method1': '疏凿饮子',
        'method2': '肾炎四味片等（四妙丸治湿热下注）'
    }, {
        'subName': '脾阳虚衰',
        'des': '腰以下肿甚，按之凹陷不易恢复，纳减便溏',
        'method1': '实脾饮',
        'method2': '肾炎温阳片'
    }, {
        'subName': '肾阳衰微',
        'des': '腰以下肿甚，按之凹陷不易恢复，腰酸冷痛',
        'method1': '济生肾气丸合真武汤',
        'method2': '肾炎康复片、肾康宁片等'
    }]
}, {
    'type': '腰痛',
    'subType': [{
        'subName': '肾阳虚',
        'des': '腰痛隐隐，劳则加重，卧则减轻，腰部冷痛，得热则舒，肢冷畏寒',
        'method1': '右归丸（左右阴阳）',
        'method2': '桂附地黄丸、济生肾气丸、杜仲颗粒等'
    }, {
        'subName': '肾阴虚',
        'des': '腰痛隐隐，劳则加重，卧则减轻，手足心热，潮热盗汗，口燥咽干',
        'method1': '左归丸（左右阴阳）',
        'method2': '鱼鳔丸、七宝美髯丸'
    }, {
        'subName': '瘀血腰痛',
        'des': '腰痛如刺，痛有定处，痛处拒按，日轻夜重，舌质暗紫有瘀斑，脉涩',
        'method1': '身痛逐瘀汤',
        'method2': '瘀血痹、腰痹通、舒筋活血定痛散等'
    }, {
        'subName': '湿热腰痛',
        'des': '腰部重着热痛，暑湿阴雨天气加重，身体困重，小便短赤，苔黄腻',
        'method1': '四妙丸',
        'method2': '三妙丸、四妙丸、湿热痹颗粒、豨莶丸等'
    }, {
        'subName': '寒湿腰痛',
        'des': '腰部冷痛重着，寒冷和阴雨天加重，静卧疼痛不减。苔白腻',
        'method1': '甘姜苓术汤',
        'method2': '秒杀：干姜散寒止痛'
    }]
}, {
    'type': '郁证',
    'subType': [{
        'subName': '痰气郁结',
        'des': '咽中梗阻，有异物感，咽之不下，咯之不出（俗称“梅核气”）',
        'method1': '半夏厚朴汤',
        'method2': '舒肝平胃丸'
    }, {
        'subName': '心神失养',
        'des': '精神恍惚，心神不宁，悲忧善哭，喜怒无常',
        'method1': '甘麦大枣汤',
        'method2': '脑乐静、脑力静糖浆'
    }, {
        'subName': '肝气郁结',
        'des': '精神抑郁，胸闷胁胀，嗳气，喜太息（即喜欢唉声叹气）',
        'method1': '柴胡疏肝散',
        'method2': '丹栀逍遥丸、逍遥丸、越鞠丸'
    }, {
        'subName': '心脾两虚',
        'des': '情绪不宁，多思善疑，心悸少寐，面色无华（脾主思）',
        'method1': '归脾汤',
        'method2': '人参归脾丸'
    }]
}, {
    'type': '虚劳',
    'subType': [{
        'subName': '血虚',
        'des': '头晕眼花，心悸多梦，面色无华，口唇爪甲色淡，经量少',
        'method1': '四物汤',
        'method2': '归芪口服液、薯蓣丸（红薯血红色）'
    }, {
        'subName': '阴虚',
        'des': '形体消瘦，口燥咽干，潮热颧红，五心烦热，盗汗',
        'method1': '沙参麦冬汤',
        'method2': '人参固本丸、河车大造丸'
    }, {
        'subName': '气虚',
        'des': '面色㿠白，气短懒言，头昏神疲，肢体无力',
        'method1': '四君子汤',
        'method2': '十一味参芪胶囊、参芪十一味颗粒'
    }, {'subName': '阳虚', 'des': '畏寒怕冷，四肢不温，口淡不渴，自汗', 'method1': '附子理中汤', 'method2': '补白颗粒'}]
}, {
    'type': '痹证',
    'subType': [{
        'subName': '行痹',
        'des': '关节酸痛，游走不定，恶风发热 （行痹，以风邪为主，要祛风通络）',
        'method1': '防风汤',
        'method2': '九味羌活丸'
    }, {
        'subName': '痛痹',
        'des': '关节疼痛，痛势较剧，遇寒痛甚 （痛痹，以寒邪为主，要散寒通络）',
        'method1': '乌头汤 （乌头散寒止痛）',
        'method2': '风湿定片、寒湿痹颗粒'
    }, {
        'subName': '着痹',
        'des': '关节疼痛、肌肉酸楚、重着肿胀 （着痹，以湿邪为主，要除湿通络）',
        'method1': '薏苡仁汤（薏米利水渗湿）',
        'method2': '湿热者可选用四妙丸'
    }, {
        'subName': '尪痹',
        'des': '关节肿大僵硬，变形，腰膝酸软 （尪痹，有肝肾亏损，要滋养肝肾）',
        'method1': '桃红饮合独活寄生汤',
        'method2': '独活寄生合剂、天麻丸、尪痹颗粒等'
    }]
}, {
    'type': '中暑',
    'subType': [{
        'subName': '阳暑',
        'des': '发热汗多，头痛面红，烦躁，胸闷，口渴多饮，脉洪大',
        'method1': '白虎汤',
        'method2': '清暑解毒颗粒、暑热感冒颗粒'
    }, {
        'subName': '阴暑',
        'des': '发热恶寒，无汗，身重疼痛，神疲倦怠',
        'method1': '香薷饮',
        'method2': '藿香正气水、暑湿感冒颗粒、暑症片'
    }]
}, {
    'type': '内伤发热',
    'subType': [{
        'subName': '气虚发热',
        'des': '发热常在劳累后发作，倦怠乏力，自汗，易于感冒',
        'method1': '补中益气汤',
        'method2': '补中益气丸'
    }, {
        'subName': '阴虚发热',
        'des': '午后潮热或夜间发热，手足心热，盗汗，口干咽燥',
        'method1': '清骨散（阴虚骨蒸潮热）',
        'method2': '知柏地黄丸'
    }, {
        'subName': '气郁发热',
        'des': '发热随着情绪而起伏，精神抑郁，胁胀，烦躁易怒',
        'method1': '丹栀逍遥散',
        'method2': '无'
    }, {
        'subName': '血瘀发热',
        'des': '午后或夜晚发热，口干不多饮，有固定痛处，面色晦暗。舌青紫瘀斑',
        'method1': '血府逐瘀汤',
        'method2': '无'
    }]
}, {
    'type': '积聚',
    'subType': [{
        'subName': '肝气郁结',
        'des': '腹中结块，柔软不坚，时聚时散，攻窜胀痛，脘胁胀闷不适',
        'method1': '逍遥散合木香顺气散',
        'method2': '逍遥丸、木香顺气丸等'
    }, {
        'subName': '气滞血阻',
        'des': '腹部积块，质软不坚，固定不移（瘀血），胀痛不适（气滞）',
        'method1': '柴胡疏肝散合失笑散',
        'method2': '气血都瘀堵，痛得都不会笑了'
    }, {
        'subName': '瘀血内结',
        'des': '腹部积块，质地较硬，固定不移，面色晦暗，舌紫瘀斑',
        'method1': '膈下逐瘀汤合六君子汤',
        'method2': '鳖甲煎丸、化癥回生片'
    }, {
        'subName': '正虚邪结',
        'des': '久病体弱，积块坚硬，饮食大减，肌肉瘦削，神倦乏力',
        'method1': '八珍汤合化积丸',
        'method2': '和络舒肝胶囊、慢肝养阴胶囊'
    }]
}, {
    'type': '疖的',
    'subType': [{
        'subName': '热毒蕴结',
        'des': '好发于项后发际、背部、臀部；伴发热，口渴，便秘',
        'method1': '五味消毒饮合黄连解毒汤',
        'method2': '连翘败毒丸、芩连片等'
    }, {
        'subName': '湿毒蕴结',
        'des': '疖以红赤肿胀，灼热疼痛为主，脓肿渐大，中央变软、波动',
        'method1': '仙方活命饮合透脓散',
        'method2': '皮肤病血毒丸（血中湿毒）'
    }, {
        'subName': '阴虚内热',
        'des': '疖肿范围较大，易转成有头疽，口干唇燥，脉细数',
        'method1': '仙方活命饮合增液汤',
        'method2': '知柏地黄丸'
    }]
}, {
    'type': '乳痈',
    'subType': [{
        'subName': '气滞热壅',
        'des': '乳汁郁积结块，皮色不变或微红，肿胀疼痛',
        'method1': '瓜蒌牛蒡汤',
        'method2': '活血解毒丸、活血消炎丸'
    }, {
        'subName': '热毒炽盛',
        'des': '乳房肿痛加剧，皮肤焮红而灼热，继之肿块变软，有应指感',
        'method1': '五味消毒饮合透脓散',
        'method2': '牛黄化毒片'
    }]
}, {
    'type': '乳癖',
    'subType': [{
        'subName': '肝郁痰凝',
        'des': '多见于青壮年妇女。乳房肿块随喜怒消长，伴胸闷胁胀，善郁易怒',
        'method1': '逍遥蒌贝散',
        'method2': '乳核散结片、乳疾灵颗粒等'
    }, {
        'subName': '冲任失调',
        'des': '多见于中年妇女。乳房肿块月经前加重，伴腰膝酸软，神疲倦怠',
        'method1': '二仙汤合四物汤（二仙对冲任）',
        'method2': '乳增宁胶囊（失调对不宁）'
    }]
}, {
    'type': '粉刺',
    'subType': [{
        'subName': '肺经风热',
        'des': '丘疹色红，或有痒痛，口渴喜饮，大便秘结，小便短赤',
        'method1': '枇杷清肺饮',
        'method2': '化瘀祛斑胶囊'
    }, {
        'subName': '胃肠湿热',
        'des': '颜面、胸背皮肤油腻，皮疹红肿，口臭便秘，舌苔黄腻',
        'method1': '茵陈蒿汤',
        'method2': '消痤丸、金花消痤丸、清热暗疮片'
    }, {
        'subName': '痰湿瘀滞',
        'des': '皮疹色暗红（瘀血），以结节、脓肿、囊肿、瘢痕为主',
        'method1': '二陈汤合桃红四物汤',
        'method2': '当归苦参丸（当归化瘀，苦参燥湿）'
    }]
}, {
    'type': '瘾疹',
    'subType': [{
        'subName': '风寒束表',
        'des': '风团色白，遇寒加重，得暖则减；伴恶寒，口不渴，脉浮紧',
        'method1': '桂枝麻黄各半汤',
        'method2': '荆防颗粒、肤痒颗粒'
    }, {
        'subName': '风热犯表',
        'des': '风团鲜红，遇热则剧，得冷则减；伴发热，恶寒，脉浮数',
        'method1': '消风散',
        'method2': '消风止痒颗粒、荆肤止痒颗粒等'
    }, {
        'subName': '胃肠湿热',
        'des': '风团大片色红，瘙痒剧烈；伴脘腹疼痛，恶心呕吐，大便秘结或泄泻',
        'method1': '防风通圣散',
        'method2': '皮肤病血毒丸、乌蛇止痒丸等'
    }, {
        'subName': '血虚风燥',
        'des': '反复发作，迁延日久，午后或夜间加剧，心烦易怒，口干，手足心热',
        'method1': '当归饮子',
        'method2': '润燥止痒胶囊'
    }]
}, {
    'type': '痔的',
    'subType': [{
        'subName': '风伤肠络',
        'des': '大便带血、滴血或呈现喷射状出血，肛门瘙痒，脉浮数',
        'method1': '凉血地黄汤（凉风）',
        'method2': '槐角丸等'
    }, {
        'subName': '湿热下注',
        'des': '便血色鲜红，量较多，肛门灼热，舌红苔黄腻',
        'method1': '脏连丸（黄连清热燥湿）',
        'method2': '地榆槐角丸等'
    }, {
        'subName': '气滞血瘀',
        'des': '痔疮脱出，坠胀或胀痛，肛缘水肿、血栓形成',
        'method1': '止痛如神汤（瘀血疼痛）',
        'method2': '痔宁片'
    }, {
        'subName': '脾虚气陷',
        'des': '痔核脱出，需手法复位，纳少便溏，神疲少气',
        'method1': '补中益气汤',
        'method2': '补中益气丸、补气升提片等'
    }]
}, {
    'type': '阳痿',
    'subType': [{
        'subName': '惊恐伤肾',
        'des': '阳痿，易惊，胆怯多疑，夜多噩梦',
        'method1': '启阳娱心丹',
        'method2': '滋肾宁神口服液、补肾安神口服液'
    }, {
        'subName': '心脾两虚',
        'des': '阳痿，神疲乏力，面色无华，食少纳呆，腹胀便溏',
        'method1': '归脾汤',
        'method2': '人参归脾丸、刺五加脑灵液等'
    }, {
        'subName': '肾阳不足',
        'des': '阳痿，形寒肢冷，头晕耳鸣，腰膝酸软',
        'method1': '右归丸',
        'method2': '刚考过，略'
    }, {'subName': '肝郁不舒', 'des': '阳痿，心情抑郁，胸胁胀满，善太息', 'method1': '逍遥散', 'method2': '疏肝益阳胶囊'}]
}, {
    'type': '不育',
    'subType': [{
        'subName': '肾虚精亏',
        'des': '阳痿+精液描述+腰膝酸软，耳鸣耳聋',
        'method1': '大补元煎合五子衍宗丸',
        'method2': '还精煎液、麒麟丸、补肾康乐片等'
    }, {
        'subName': '肝郁气滞',
        'des': '阳痿+精液描述+心情抑郁，胸胁胀痛',
        'method1': '柴胡疏肝散',
        'method2': '柴胡舒肝丸'
    }, {
        'subName': '湿热下注',
        'des': '阳痿+精液描述+小腹急满，小便短赤',
        'method1': '程氏萆薢分清饮',
        'method2': '黄精赞育胶囊'
    }]
}, {
    'type': '月经先期',
    'subType': [{
        'subName': '脾气虚',
        'des': '月经提前，量多色淡，质清稀，小腹空坠，纳少便溏',
        'method1': '补中益气汤或归脾汤',
        'method2': '人参归脾丸、当归丸（君药是黄芪）'
    }, {
        'subName': '肾气虚',
        'des': '月经提前，经色淡暗，质清稀，腰膝酸软，头晕耳鸣',
        'method1': '固阴煎或归肾丸',
        'method2': '女金丹丸'
    }, {
        'subName': '肝郁血热',
        'des': '月经提前，经色深红，质 稠，少腹胀痛，胸闷胁胀',
        'method1': '丹栀逍遥散',
        'method2': '丹栀逍遥丸'
    }]
}, {
    'type': '月经后期',
    'subType': [{
        'subName': '肾虚证',
        'des': '月经延后，质清稀，腰酸腿软，头晕耳鸣',
        'method1': '归肾丸',
        'method2': '春血安胶囊、天紫红女金胶囊'
    }, {
        'subName': '血虚证',
        'des': '月经延后，质清稀，面色萎黄，头晕眼花',
        'method1': '大补元煎',
        'method2': '四物益母丸、复方益母草膏'
    }, {
        'subName': '痰湿证',
        'des': '月经延后，质黏稠，脘闷恶心，口腻多痰',
        'method1': '芎归二陈汤',
        'method2': '二陈丸'
    }, {
        'subName': '气滞证',
        'des': '月经延后，小腹、胸胁、乳房胀痛',
        'method1': '乌药汤',
        'method2': '益母丸、调经丸、调经活血片等'
    }]
}, {
    'type': '月经不定期',
    'subType': [{
        'subName': '肾虚证',
        'des': '经行或先或后，量少，色淡暗，质稀薄；或腰骶酸痛，头晕耳鸣',
        'method1': '固阴煎',
        'method2': '鹿胎胶囊'
    }, {
        'subName': '脾虚证',
        'des': '经来先后无定，经量多，色淡质稀，神倦乏力，脘腹胀满，纳呆食少',
        'method1': '归脾汤',
        'method2': '归脾丸、薯蓣丸'
    }, {
        'subName': '肝郁证',
        'des': '经行或先或后，色暗红或紫红，有血块，胸胁、乳房、少腹胀痛',
        'method1': '逍遥散',
        'method2': '香附丸、妇科十味片、妇科调经片'
    }]
}, {
    'type': '月经过少',
    'subType': [{
        'subName': '肾虚证',
        'des': '经行量少色淡，头晕耳鸣，腰骶酸软',
        'method1': '归肾丸',
        'method2': '调经促孕丸、妇宁康片、巴戟口服液等'
    }, {
        'subName': '气血亏虚',
        'des': '经血量少色淡，质稀薄，面色萎黄，心悸气短',
        'method1': '滋血汤',
        'method2': '八珍益母丸、驴胶补血颗粒、养血当归糖浆等'
    }, {
        'subName': '痰湿证',
        'des': '经血量少，质黏稠或夹杂黏液；倦怠乏力',
        'method1': '六君子加芎归汤',
        'method2': '益母丸联用二陈丸'
    }, {
        'subName': '血瘀证',
        'des': '经血量少，色暗红夹有小血块；舌暗瘀斑',
        'method1': '桃红四物汤',
        'method2': '益母草颗粒、调经活血片等'
    }]
}, {
    'type': '月经过多',
    'subType': [{
        'subName': '气虚证',
        'des': '经量多，质清稀；神疲肢倦，气短懒言',
        'method1': '举元煎合安冲汤',
        'method2': '八珍颗粒、十全大补丸、当归丸等'
    }, {
        'subName': '血热证',
        'des': '经量多，质稠黏；心烦口渴，身热面赤',
        'method1': '保阴煎',
        'method2': '宫血宁胶囊、断血流片、止血灵胶囊'
    }, {
        'subName': '血瘀证',
        'des': '经量多，色紫黑，多血块',
        'method1': '失笑散',
        'method2': '宫血停颗粒、坤宁口服液、宫宁颗粒'
    }]
}, {
    'type': '痛经',
    'subType': [{
        'subName': '气滞血瘀',
        'des': '小腹胀痛，紫暗有块，胸闷不舒，乳房胀痛',
        'method1': '膈下逐瘀汤',
        'method2': '调经丸、元胡止痛片、益母丸等'
    }, {
        'subName': '寒凝血瘀',
        'des': '小腹冷痛，得热则舒，色暗有块，形寒肢冷',
        'method1': '少腹逐瘀汤',
        'method2': '温经丸、少腹逐瘀丸（小肚子受寒痛经）'
    }, {
        'subName': '湿热瘀阻',
        'des': '小腹灼热胀痛，拒 按，经色暗红，质稠有块',
        'method1': '清热调血汤',
        'method2': '当归芍药颗粒等'
    }, {
        'subName': '气血虚弱',
        'des': '小腹隐痛喜按，质清稀；面色无华，神疲乏力',
        'method1': '圣愈汤',
        'method2': '妇女养血丸、参茸白凤丸、八宝坤顺丸'
    }, {
        'subName': '肝肾亏虚',
        'des': '小腹绵绵作痛，质稀薄；腰膝酸软，头晕耳鸣',
        'method1': '调肝汤',
        'method2': '安坤赞育丸、复方乌鸡口服液'
    }]
}, {
    'type': '崩漏',
    'subType': [{
        'subName': '气血两虚',
        'des': '经血量多或淋沥不尽，血色淡薄，面色无华，气短懒言',
        'method1': '归脾汤',
        'method2': '定坤丹、乌鸡白凤丸等'
    }, {
        'subName': '脾不统血',
        'des': '出血量多，日久而止，气短神疲，面色㿠白，面浮肢肿',
        'method1': '固本止崩汤（后天之本脾）',
        'method2': '人参归脾丸（易和气血两虚崩漏混淆）'
    }, {
        'subName': '肝肾不足',
        'des': '月经非时而下，咽干颧红，心烦潮热，腰膝酸软',
        'method1': '左归丸合二至丸',
        'method2': '安坤赞育丸、春血安、妇科止血灵等'
    }, {
        'subName': '瘀血阻络',
        'des': '经血非时而下，经色暗有血块，舌紫暗有瘀点',
        'method1': '逐瘀止血汤，将军斩关汤',
        'method2': '宫血停颗粒、四物胶囊等'
    }]
}, {
    'type': '绝经前后诸证',
    'subType': [{
        'subName': '阴虚火旺',
        'des': '绝经前后，心烦易怒，坐卧不宁，口干渴饮，尿黄便燥',
        'method1': '百合地黄汤',
        'method2': '更年安片、更年宁心胶囊等'
    }, {
        'subName': '脾肾阳虚',
        'des': '经断前后，腰脊冷痛，肢软无力，神疲体倦，浮肿便溏',
        'method1': '右归丸合四君子汤',
        'method2': '龙凤宝胶囊'
    }, {
        'subName': '肝郁肾虚',
        'des': '经断前后，腰膝酸软，烘热汗出，情绪异常，乳房胀痛',
        'method1': '一贯煎合逍遥散',
        'method2': '坤宝丸、女珍颗粒'
    }]
}, {
    'type': '带下过多',
    'subType': [{
        'subName': '湿热下注',
        'des': '带下量多，色黄，质 黏，有臭气',
        'method1': '止带方',
        'method2': '妇炎净胶囊、妇炎康片、盆炎净颗粒、宫炎平片'
    }, {
        'subName': '脾虚湿盛',
        'des': '带下量多，色白，质稀薄，绵绵不断，无臭',
        'method1': '完带汤',
        'method2': '妇科白带膏、除湿白带丸'
    }, {
        'subName': '肾阳亏虚',
        'des': '带下量多，质地清稀如水，腰痛如折，畏寒肢冷',
        'method1': '内补丸',
        'method2': '参茸卫生丸、金樱子膏'
    }]
}, {
    'type': '小儿积滞',
    'subType': [{
        'subName': '乳食内积',
        'des': '不思乳食，脘腹胀满疼痛，嗳腐酸馊，大便酸臭',
        'method1': '食积用保和丸',
        'method2': '大山楂丸、四磨汤、小儿消食/化食丸'
    }, {
        'subName': '脾虚夹积',
        'des': '不思乳食，脘腹胀满喜按，萎黄消瘦，大便稀溏酸腥',
        'method1': '健脾丸',
        'method2': '健胃消食片、小儿胃宝丸'
    }]
}, {
    'type': '小儿厌食',
    'subType': [{
        'subName': '脾胃阴虚',
        'des': '不思进食，食少饮多，皮肤失润，大便偏干，手足心热',
        'method1': '养胃增液汤',
        'method2': '儿宝颗粒（秒杀：宝宝→婴“阴”儿）'
    }, {
        'subName': '脾失健运',
        'des': '食欲不振，食而乏味，形体尚可，精神如常，脉尚有力',
        'method1': '不换金正气散',
        'method2': '健儿消食口服液、复方消食茶'
    }, {
        'subName': '脾胃气虚',
        'des': '不思进食，食不知味，形体偏瘦，神倦多汗，脉缓无力',
        'method1': '异功散',
        'method2': '参苓白术散、启脾丸'
    }]
}, {
    'type': '鼻渊',
    'subType': [{
        'subName': '风热蕴肺',
        'des': '鼻塞，涕黄稠而量多。伴头痛，发热，汗出，咳嗽，痰多，脉浮数',
        'method1': '泻白散合辛夷清肺饮',
        'method2': '利鼻片、鼻渊通窍、鼻渊片、鼻舒适等'
    }, {
        'subName': '胆经郁热',
        'des': '鼻塞，脓涕量多，色黄或黄绿。头痛目眩，口苦，耳鸣，烦躁易怒',
        'method1': '龙胆泻肝汤',
        'method2': '鼻渊舒胶囊、藿胆丸、胆香鼻炎片'
    }]
}, {
    'type': '口疮',
    'subType': [{
        'subName': '脾肾阳虚',
        'des': '口疮疼痛较轻，久难愈合；周边淡红。腰膝冷痛，小便清长',
        'method1': '附子理中合金匮肾气丸',
        'method2': '附子理中丸、金匮肾气丸'
    }, {
        'subName': '心脾积热',
        'des': '口腔黏膜溃疡，灼痛明显。周边红肿。口渴心烦，尿黄便秘',
        'method1': '凉膈散',
        'method2': '牛黄清胃丸、导赤丸'
    }]
}]

let cur_choice = null;
let cur_data = null;
let choices = ["A", "B", "C", "D"]

let refineData = []
for (let i = 0; i < data.length; ++i) {
    let subTypes = data[i]["subType"];
    for (let j = 0; j < subTypes.length; ++j) {
        refineData.push(subTypes[j]);
    }
}

function reload() {
    let ques_text = document.getElementById("question_des");
    cur_choice = Math.floor(Math.random() * choices.length);
    cur_data = Math.floor(Math.random() * refineData.length);

    let map = {};

    map[choices[cur_choice]] = cur_data;

    let choiceSet = new Set();
    let dataSet = new Set();

    choiceSet.add(cur_choice);
    dataSet.add(cur_data);

    while (choiceSet.size < choices.length) {
        let i = Math.floor(Math.random() * choices.length);
        while (choiceSet.has(i)) {
            i = Math.floor(Math.random() * choices.length);
        }
        choiceSet.add(i);
        let j = Math.floor(Math.random() * refineData.length);
        while (dataSet.has(j)) {
            j = Math.floor(Math.random() * refineData.length);
        }
        map[choices[i]] = refineData[j];
    }

    for (const key in Object.keys(map)) {
        let choice = document.getElementById("choice_" + key);
        choice.innerText = map[key]["subName"];
    }
    ques_text.innerText = refineData[cur_data]["des"];
}

function check() {
    for (let choice of choices) {
        let radio = document.getElementById("choice_" + choice);
        if (radio.selected()) {
            if (choices[cur_choice] === choice) {
                console.log("正确答案");
            } else {
                console.log("错误答案");
            }
        }
    }
}